GUdaoxi/demo_qspi/QSPI_QPI/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_cmu.h
/**
  * @brief    Disable Group1 Periph Bus Clock
  * @rmtoll   PCLKCR1        FL_CMU_DisableGroup1BusClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_APB2CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB2CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB1CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_APB1CLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHBCLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHBCLK_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTICK_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTICK_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTEM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SYSTEM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_RCHF_FREQUENCY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_RCHF_FREQUENCY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_PSC
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_PLL_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_FDET
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTLF_FDET
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LSCLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_SET_LSCLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTHF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_XTHF_START_WAIT_CYCLE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_EXTI_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPUART_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART5_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART4_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_BSTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_LPTIM16_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART3_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART2_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART1_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_UART0_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_AHB_MASTER_PRIORITY
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFD_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFD_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFDRAM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_CANFDRAM_CLK_SOURCE
  *           @arg @ref FL__
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL_CMU_
  *           @arg @ref FL__
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_SCU
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_IWDT
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_ANAC
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_PAD
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_SVD
  *           @arg @ref FL_CMU_GROUP1_BUSCLK_COMP
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableGroup1BusClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->PCLKCR1, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Disable Group2 Periph Bus Clock
  * @rmtoll   PCLKCR2        FL_CMU_DisableGroup2BusClock
  * @param    peripheral This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableGroup2BusClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->PCLKCR2, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Disable Group3 Periph Bus Clock
  * @rmtoll   PCLKCR3        FL_CMU_DisableGroup3BusClock
  * @param    peripheral This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableGroup3BusClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->PCLKCR3, ((peripheral & 0xffffffff) << 0x0U));
}

/**
  * @brief    Disable Group4 Periph Bus Clock
  * @rmtoll   PCLKCR4        FL_CMU_DisableGroup4BusClock
  * @param    peripheral This parameter can be one of the following values:
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_BSTIM16
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_TAU0
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_TAU1
  *           @arg @ref FL_CMU_GROUP4_BUSCLK_ATIM
  * @retval   None
  */
__STATIC_INLINE void FL_CMU_DisableGroup4BusClock(uint32_t peripheral)
{
    CLEAR_BIT(CMU->PCLKCR4, ((peripheral & 0xffffffff) << 0x0U));
}

